Revit 2024 API
ViewOrientation3D.ForwardDirection Property
 The forward direction vector
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public XYZ ForwardDirection { get; }
Visual Basic
Public ReadOnly Property ForwardDirection As XYZ
	Get
Visual C++
public:
property XYZ^ ForwardDirection {
	XYZ^ get ();
}
See Also
ViewOrientation3D Class
Autodesk.Revit.DB Namespace